performance_ruby_2_2_0/rhebok/active_record.txt
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:479: Connection reset by peer
[...]
[error] socket: -850974976 connection timed out.: Connection timed out
[error] socket: -1002043648 connection timed out.: Connection timed out
[error] socket: -976865536 connection timed out.: Connection timed out
[error] socket: -725084416 connection timed out.: Connection timed out
[error] socket: -683120896 connection timed out.: Connection timed out
[error] socket: -825796864 connection timed out.: Connection timed out
[error] socket: -934902016 connection timed out.: Connection timed out
[error] socket: -364198144 connection timed out.: Connection timed out
[error] socket: -515266816 connection timed out.: Connection timed out
[error] socket: -1035614464 connection timed out.: Connection timed out
[error] socket: -825796864 connection timed out.: Connection timed out
[error] socket: -867760384 connection timed out.: Connection timed out
[error] socket: -960080128 connection timed out.: Connection timed out
[error] socket: -406161664 connection timed out.: Connection timed out
[error] socket: -565623040 connection timed out.: Connection timed out
[error] socket: -464910592 connection timed out.: Connection timed out
[error] socket: -976865536 connection timed out.: Connection timed out
[error] socket: -448125184 connection timed out.: Connection timed out
[error] socket: -263485696 connection timed out.: Connection timed out
[error] socket: -892938496 connection timed out.: Connection timed out
[error] socket: -574015744 connection timed out.: Connection timed out
[error] socket: -347412736 connection timed out.: Connection timed out
[error] socket: -523659520 connection timed out.: Connection timed out
[error] socket: -490088704 connection timed out.: Connection timed out
[error] socket: -532052224 connection timed out.: Connection timed out
[error] socket: -372590848 connection timed out.: Connection timed out
[error] socket: -481696000 connection timed out.: Connection timed out
[error] socket: -775440640 connection timed out.: Connection timed out
[error] socket: -473303296 connection timed out.: Connection timed out
[error] socket: -683120896 connection timed out.: Connection timed out
[error] socket: -397768960 connection timed out.: Connection timed out
[error] socket: -548837632 connection timed out.: Connection timed out
[error] socket: -876153088 connection timed out.: Connection timed out
[error] socket: -892938496 connection timed out.: Connection timed out
[error] socket: -800618752 connection timed out.: Connection timed out
[error] socket: -641157376 connection timed out.: Connection timed out
[error] socket: -313841920 connection timed out.: Connection timed out
[error] socket: -850974976 connection timed out.: Connection timed out
[error] socket: -649550080 connection timed out.: Connection timed out
[error] socket: -699906304 connection timed out.: Connection timed out
[alert] socket: -1052399872 select timed out: Connection timed out
[error] socket: -582408448 connection timed out.: Connection timed out
[error] socket: -918116608 connection timed out.: Connection timed out
[error] socket: -548837632 connection timed out.: Connection timed out
[error] socket: -372590848 connection timed out.: Connection timed out
[error] socket: -792226048 connection timed out.: Connection timed out
[error] socket: -280271104 connection timed out.: Connection timed out
[error] socket: -968472832 connection timed out.: Connection timed out
[error] socket: -347412736 connection timed out.: Connection timed out
[error] socket: -1027221760 connection timed out.: Connection timed out
[error] socket: -733477120 connection timed out.: Connection timed out
[error] socket: -263485696 connection timed out.: Connection timed out
[error] socket: -741869824 connection timed out.: Connection timed out
[error] socket: -1060792576 connection timed out.: Connection timed out
[error] socket: -397768960 connection timed out.: Connection timed out
[error] socket: -951687424 connection timed out.: Connection timed out
[error] socket: -926509312 connection timed out.: Connection timed out
[error] socket: -649550080 connection timed out.: Connection timed out
[error] socket: -271878400 connection timed out.: Connection timed out
[error] socket: -322234624 connection timed out.: Connection timed out
[error] socket: -473303296 connection timed out.: Connection timed out
[error] socket: -498481408 connection timed out.: Connection timed out
[error] socket: -347412736 connection timed out.: Connection timed out
[error] socket: -414554368 connection timed out.: Connection timed out
[error] socket: -422947072 connection timed out.: Connection timed out
[error] socket: -456517888 connection timed out.: Connection timed out
[error] socket: -364198144 connection timed out.: Connection timed out
      done.

Transactions:		       99855 hits
Availability:		       99.86 %
Elapsed time:		     1452.28 secs
Data transferred:	     4565.48 MB
Response time:		        1.28 secs
Transaction rate:	       68.76 trans/sec
Throughput:		        3.14 MB/sec
Concurrency:		       88.08
Successful transactions:       99855
Failed transactions:	         145
Longest transaction:	       64.98
Shortest transaction:	        0.02
 
FILE: /var/log/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.